// stdafx.h: включаемый файл для стандартных системных включаемых файлов
// или включаемых файлов для конкретного проекта, которые часто используются, но
// не часто изменяются
//

#pragma once

#include "targetver.h"

#include <stdio.h>
#include <tchar.h>



// TODO: Установите здесь ссылки на дополнительные заголовки, требующиеся для программы
/*
	Разработка удобного пользовательского меню, 
	включающего следующие опции:

+	авторизация пользователя, 
+	хранение пароля в зашифрованном виде;
-	просмотр информации;
-	добавление, 
-	редактирование и 
-	удаление записей;
-	реализация заказа (вывод отчета), 
-	разработка бизнес функций;
-	другие опции в зависимости от специфики задачи.

+-	Исходная информация хранится в текстовых (бинарных) файлах, 
	разрешено использовать реляционную БД.
	Предусмотреть использование в программе следующих аспектов:
+	базовые принципы ООП;
+	стандартные и пользовательские функции, 
+	дружественные и виртуальные функции;
+	пространства имен;
+	предусмотреть обработку ошибок;
-	транзакций;
+	паттерны проектирования;
-	смарт-указатели;
	механизмы абстракции:
+	классы и наследование;
+	перегрузка операторов, функций;
-	шаблоны;
+	динамическое выделение памяти.

	Обязательно использовать 
+	сокрытие данных (инкапсуляция), 
+	перегрузку методов, 
+	переопределение методов, 
+	абстрактные типы данных (интерфейсы, абстрактные классы), 
+	передачу параметров по ссылке и по значению, 
+	статические методы.
*/